In [3]:
import pandas as pd

location="Resources/purchase_data.csv"

data_frame=pd.read_csv(location)
data_frame.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [4]:
data_frame.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [5]:
data_frame=data_frame.dropna(how='any')
data_frame.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [6]:
data_frame.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

### Player Count

In [7]:
player_data=data_frame["SN"].unique()
player_number=len(player_data)
player_count=pd.DataFrame({"Total Players":[player_number]})
player_count

   Total Players
0            576

### Purchasing Analysis (Total)

#### Number of Unique Items

In [8]:
unique_item=data_frame["Item Name"].unique()
item_number=len(unique_item)
item_number

179

#### Average Purchase Price

In [9]:
purchase_price_data=data_frame["Price"]
average_purchase_price=purchase_price_data.mean()
average_purchase_price=round(average_purchase_price,2)
average_purchase_price

3.05

#### Total Number of Purchases

In [10]:
purchase_data=data_frame["Purchase ID"]
purchase_number=purchase_data.count()
purchase_number

780

#### Total Revenue

In [11]:
revenue=purchase_price_data.sum()  
revenue

2379.77

In [12]:
purchasing_analysis=pd.DataFrame({
    "number of unique items":[item_number],
    "average purchase price":[average_purchase_price],
    "total number of purchase":[purchase_number],
    "total revenue":[revenue]})

purchasing_analysis

,number of unique items,average purchase price,total number of purchase,total revenue
0,179,3.05,780,2379.77

### Gender Demographics

#### Percentage and Count of Players by Gender

In [13]:
def gender_number(gender):
    data_player_gender=data_frame.loc[data_frame["Gender"]==gender,["SN"]]
    gender_player_number=len(data_player_gender["SN"].unique())
    return gender_player_number

In [14]:
n_male=gender_number("Male")
n_female=gender_number("Female")
n_disclosure=gender_number("Other / Non-Disclosed")

In [15]:
def gender_percent(gender):
    percentage_gender=round((gender_number(gender)/player_number)*100,2)
    return percentage_gender

In [16]:
p_male=gender_percent("Male")
p_female=gender_percent("Female")
p_disclosed=gender_percent("Other / Non-Disclosed")

In [17]:
pcpg=pd.DataFrame({
              "gender":["Male","Female","Other / Non-Disclosed"],
              "number of players":[n_male,n_female,n_disclosure],
              "percentage of players":[p_male,p_female,p_disclosed]})
pcpg

                  gender  number of players  percentage of players
0                   Male                484                  84.03
1                 Female                 81                  14.06
2  Other / Non-Disclosed                 11                   1.91

### Purchasing Analysis (Gender)

#### Purchase Count

In [19]:
def gender_purchase(gender):
    gender_purchase=data_frame.loc[data_frame["Gender"]==gender,["Purchase ID"]]
    gender_purchase_count=len(gender_purchase)
    return gender_purchase_count

In [20]:
pur_male=gender_purchase("Male")
pur_female=gender_purchase("Female")
pur_disclosed=gender_purchase("Other / Non-Disclosed")

#### Average Purchase Price

In [22]:
def average_price_by_gender(gender):
    average_price=data_frame.loc[data_frame["Gender"]==gender,["Price"]].mean()
    average_price=round(average_price,2)
    return average_price

In [23]:
pavg_male=average_price_by_gender("Male")
pavg_female=average_price_by_gender("Female")
pavg_disclosed=average_price_by_gender("Other / Non-Disclosed")

#### Total Purchase Price

In [25]:
def total_purchase_by_gender(gender):
    total_price=data_frame.loc[data_frame["Gender"]==gender,["Price"]].sum()
    return total_price

In [26]:
tprice_male=total_purchase_by_gender("Male")
tprice_female=total_purchase_by_gender("Female")
tprice_disclosed=total_purchase_by_gender("Other / Non-Disclosed")

#### Average Purchase Total per Person by Gender

In [27]:
def average_value_by_gender(gender):
    avek=total_purchase_by_gender(gender)/gender_number(gender)
    avek=round(avek,2)
    return avek

In [28]:
ave_purc_male=average_value_by_gender("Male")
ave_purc_female=average_value_by_gender("Female")
ave_purc_disclosed=average_value_by_gender("Other / Non-Disclosed")

In [54]:
purchase_analysis=pd.DataFrame({
    "Gender":["Male","Female","Other / Non-Disclosed"],
    "Number of Unique Items":[pur_male,pur_female,pur_disclosed],
    "Average Price":[pavg_male,pavg_female,pavg_disclosed],
    "Number of Purchases":[tprice_male,tprice_female,tprice_disclosed],
    "Total Revenue":[ave_purc_male,ave_purc_female,ave_purc_disclosed]
})
purchase_analysis

,Gender,Number of Unique Items,Average Price,Number of Purchases,Total Revenue
0,Male,652,Price 3.02 dtype: float64,Price 1967.64 dtype: float64,Price 4.07 dtype: float64
1,Female,113,Price 3.2 dtype: float64,Price 361.94 dtype: float64,Price 4.47 dtype: float64
2,Other / Non-Disclosed,15,Price 3.35 dtype: float64,Price 50.19 dtype: float64,Price 4.56 dtype: float64

### Age Demographics

In [87]:
bins=[0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,100]
group=["<10","10-14","15-19","20-24","25-29","30-34","35-39","+40"]
data_frame["Age Group"]=pd.cut(data_frame["Age"], bins, labels=group, include_lowest=True)

#### Purchase Count

In [89]:
say=data_frame.loc[:,["Price","Age Group"]].groupby(["Age Group"]).count()

#### Average Purchase

In [71]:
ave_pur=data_frame.loc[:,["Price","Age Group"]].groupby(["Age Group"]).mean()
ave_pur.sort_values(by="Price", ascending=False)

              Price
Age Group
35-39      3.601707
<10        3.353478
20-24      3.052219
15-19      3.035956
10-14      2.956429
+40        2.941538
30-34      2.931507
25-29      2.900990

#### Total Purchase Value

In [104]:
tam=data_frame.loc[:,["Price","SN","Age Group"]].groupby(["Age Group"]).sum()
tam

             Price
Age Group
<10          77.13
10-14        82.78
15-19       412.89
20-24      1114.06
25-29       293.00
30-34       214.00
35-39       147.67
+40          38.24

#### Average Purchase Total per Person by Age Group

In [107]:
ave_purc_per_person=pd.merge(say,tam,on="Age Group")
ave_purc_per_person=ave_purc_per_person.rename(columns={
    "Price_x":"Purchase Count",
    "Price_y":"Purchase Total",})
ave_purc_per_person

           Purchase Count  Purchase Total
Age Group
<10                    23           77.13
10-14                  28           82.78
15-19                 136          412.89
20-24                 365         1114.06
25-29                 101          293.00
30-34                  73          214.00
35-39                  41          147.67
+40                    13           38.24

In [108]:
ave_purc_per_person["Avg. Purchase Per Person"]=ave_purc_per_person["Purchase Total"]/ave_purc_per_person["Purchase Count"]
ave_purc_per_person

           Purchase Count  Purchase Total  Avg. Purchase Per Person
Age Group
<10                    23           77.13                  3.353478
10-14                  28           82.78                  2.956429
15-19                 136          412.89                  3.035956
20-24                 365         1114.06                  3.052219
25-29                 101          293.00                  2.900990
30-34                  73          214.00                  2.931507
35-39                  41          147.67                  3.601707
+40                    13           38.24                  2.941538

# TOP SPENDER

In [34]:
tamek=data_frame.loc[:,["SN","Purchase ID"]].groupby(["SN"]).count()
data_counter=tamek.sort_values(by="Purchase ID", ascending=False)
data_counter.head(5)

             Purchase ID
SN
Lisosia93              5
Iral74                 4
Idastidru52            4
Asur53                 3
Inguron55              3

In [35]:
price_x=data_frame.loc[:,["Price","SN"]].groupby(["SN"]).sum()
item_x=data_frame.loc[:,["Item ID","SN"]].groupby(["SN"]).count()
ave_price_x=data_frame.loc[:,["Price","SN"]].groupby(["SN"]).mean()

In [36]:
merge_df=pd.merge(price_x,item_x,on="SN")
merge_df=pd.merge(merge_df,ave_price_x,on="SN")
merge_df=merge_df.sort_values(by="Price_x",ascending=False)

In [55]:
framegroup=merge_df.rename(columns={
    "Price_x":"Purchase Total",
    "Item ID":"Purchase Number",
    "Price_y":"Average Purchase Total"})

In [56]:
framegroup.head(5)

             Purchase Total  Purchase Number  Average Purchase Total
SN
Lisosia93             18.96                5                3.792000
Idastidru52           15.45                4                3.862500
Chamjask73            13.83                3                4.610000
Iral74                13.62                4                3.405000
Iskadarya95           13.10                3                4.366667

### Most Popular Items

In [65]:
itemidname=data_frame.loc[:,["Item ID","Item Name","Price"]].groupby(["Item ID","Item Name"]).sum()
itemidname

                                                      Price
Item ID Item Name
0       Splinter                                       5.12
1       Crucifer                                      11.77
2       Verdict                                       14.88
3       Phantomlight                                  14.94
4       Bloodlord's Fetish                             8.50
...                                                     ...
178     Oathbreaker, Last Hope of the Breaking Storm  50.76
179     Wolf, Promise of the Moonwalker               26.88
181     Reaper's Toll                                  8.30
182     Toothpick                                     12.09
183     Dragon's Greatsword                            3.27

[179 rows x 1 columns]

In [97]:
itemcount=data_frame.loc[:,["Item ID","Item Name","Price"]].groupby(["Item ID","Item Name"]).count()
itemcount=itemcount.sort_values(by="Price", ascending=False)

In [98]:
itemcount=itemcount.rename(columns={
    "Item ID":"Item ID",
    "Item Name":"Item Name",
    "Price":"Piece"})
itemcount

                                                      Piece
Item ID Item Name
92      Final Critic                                     13
178     Oathbreaker, Last Hope of the Breaking Storm     12
145     Fiery Glass Crusader                              9
132     Persuasion                                        9
108     Extraction, Quickblade Of Trembling Hands         9
...                                                     ...
42      The Decapitator                                   1
51      Endbringer                                        1
118     Ghost Reaver, Longsword of Magic                  1
104     Gladiator's Glaive                                1
91      Celeste                                           1

[179 rows x 1 columns]

In [101]:
merged_item=pd.merge(itemcount,itemidname,on=["Item ID","Item Name"])
merged_item.head(5)

                                                      Piece  Price
Item ID Item Name
92      Final Critic                                     13  59.99
178     Oathbreaker, Last Hope of the Breaking Storm     12  50.76
145     Fiery Glass Crusader                              9  41.22
132     Persuasion                                        9  28.99
108     Extraction, Quickblade Of Trembling Hands         9  31.77

### Most Profitable Items

In [103]:
profitable=merged_item.sort_values(by="Price",ascending=False)
profitable.head(5)

                                                      Piece  Price
Item ID Item Name
92      Final Critic                                     13  59.99
178     Oathbreaker, Last Hope of the Breaking Storm     12  50.76
82      Nirvana                                           9  44.10
145     Fiery Glass Crusader                              9  41.22
103     Singed Scalpel                                    8  34.80